####################
# Load training data
####################

# 주어진 데이터를 이해하기 위한 각종 분석
# 데이터셋 활용 방안(train data 적음, balance 맞지 않음)

# 참고
'''
데이터 마이닝 기법을 이용한 신용카드 연체고객 예측 및 감소 방안 제시

데이터는 인적 특성 변수 9개(나이, 성별, 거주지역, 우편번호, 연간 소
득, 직업유형 등)와 행태특성 변수 73개(이용한도, 연간 이용 회수, 연간
이용금액, 연체회차, 연체금액, 사이버 회원 여부, SMS 사용 여부, 명세서
발송 매체 등) 총 82개의 항목으로 구성되어 있다.
'''

####################
# Feature extraction
####################

# 데이터에 대한 적절한 처리 및 특징 추출 방안
# 불균형이 심한 데이터를 처리 및 학습하기 위한 방안


####################
# Model Training
####################

# 2종 이상의 모델 설꼐 및 성능 비교
# 성능을 향상시키기 위한 각종 아이디어


####################
# Save model
####################
